<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px"> 

## Lab: SQL Practice

_Author: Matt Brems_

### Required Preparation

In order to run SQL queries within Python/this Jupyter notebook, you will need to install the following:

```bash
conda install sqlalchemy
conda install psycopg2
```

If you get an error trying to install `psycopg2`, you can install a stand-alone package (sufficient for everything you'll need to complete this lab) by entering the following anywhere in the terminal: 

```bash 
pip install psycopg2-binary
```

(If `pip` doesn't work for you, try `pip3 install psycopg2-binary`.)

### Instructions

In this lab, you're going to have ten prompts. Each prompt will require you to do two things:
1. Write a SQL query.
2. Use the result of that query to answer the question.

The purpose of this lab is to get you to practice your SQL - an **important** skill in data science! While it is possible to get these answers using Pandas, it should be your goal to do everything only in SQL.

**Data**: The data used in this lab is the Iowa liquor database. It contains various tables of transactions. The schema for this database is here:

<img src="./images/schema.png" alt="schema" width="750"/>

In [4]:
!pip install sqlalchemy
!pip install psycopg2

Requirement already satisfied: sqlalchemy in c:\users\sparrow\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\sparrow\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)
Collecting psycopg2
  Downloading psycopg2-2.9.5-cp39-cp39-win_amd64.whl (1.2 MB)
     ---------------------------------------- 1.2/1.2 MB 10.6 MB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.5

In [1]:
# Import Pandas and Create_Engine

import pandas as pd
from sqlalchemy import create_engine

# Set up the engine to access the data.
engine = create_engine('postgresql://analytics_student:analyticsga@analyticsga-psql.generalassemb.ly:5432/iowa_liquor_sales_database')

### Prompt 1

How many rows are there in the `stores` table of the Iowa liquor database?
1973

In [2]:
# Use a SQL query to find the answer to the above prompt.

sql = """ SELECT stores.*
FROM stores;
 """

pd.read_sql_query(sql, engine)

,store,name,store_status,store_address,address_info
0,2106,Hillstreet News and Tobacco,A,"2217 College\nCedar Falls, IA 506130000\n(42.5...",None
1,2112,Mike's Liquors,I,"407 Sharp St.\nGlenwood, IA 515340000\n(41.046...",None
2,2113,Jamboree Foods,A,"1119 Market St. Box 71\nGowrie, IA 505430000\n...",None
3,2119,Manly Liquor Store,I,"133 East Main\nManly, IA 504560000\n(43.286863...",None
4,2130,Sycamore Convenience,A,"617 Sycamore\nWaterloo, IA 507030000\n(42.4978...",None
...,...,...,...,...,...
1968,9917,Honey Creek Distillery,A,"29538, 210th St.\nKeosauqua, IA 52565\n(40.740...",None
1969,9918,Paradise Distilling Company,A,"245, Railroad Ave\nDubuque, IA 52001\n(42.4873...",None
1970,9919,Dehner Distillery,A,"7500, University Ave\nClive, IA\n(41.600352803...",None
1971,9920,Louisiana Spirits LLC,A,"20909, South I-10 Frontage Rd\nLacassine, IA 7...",None
1972,9921,maDIKwe USA,A,"3101, Ingersoll Ave\nDes Moines, IA 50312\n(41...",None

**Prompt 1 Answer**:

### Prompt 2

If you sort the stores in alphabetical order by name, which store is fourth?
3061 Cub Foods

In [3]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT s.name
FROM stores AS s
ORDER BY s.name ASC
LIMIT(4);
"""

pd.read_sql_query(sql, engine)

                                 name
0  218 Fuel Express & Chubby's Liquor
1          3047 Cub Foods / Iowa City
2               3060 Cub Foods / Ames
3         3061 Cub Foods / Sioux City

**Prompt 2 Answer**:

### Prompt 3

Among those sales whose category name is `IMPORTED VODKA`, if you sort by vendor in alphabetical order, what is the bottle price and number of bottles bought in the first 3 transactions?
> You should give us three sets of numbers - one for each transaction.

In [4]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT s.category_name, s.btl_price,s.bottle_qty,s.vendor,s.item
FROM sales AS s
WHERE s.category_name = 'IMPORTED VODKA'
ORDER BY s.vendor ASC
LIMIT(3);
"""

pd.read_sql_query(sql, engine)

    category_name btl_price  bottle_qty                     vendor    item
0  IMPORTED VODKA     $8.99          12  Adamba Imports Int'l Inc.  904783
1  IMPORTED VODKA    $28.50           6      A Hardy / U.S.A. Ltd.   36200
2  IMPORTED VODKA    $28.50          30      A Hardy / U.S.A. Ltd.   36200

**Prompt 3 Answer**:

### Prompt 4

What is the total amount of liquor sold in February 2015?

In [5]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT s.date, s.total
FROM sales AS s
LIMIT(4);
"""
pd.read_sql_query(sql, engine)

        date   total
0 2014-11-13   68.96
1 2014-11-13  206.88
2 2014-11-13  206.88
3 2014-11-13  154.38

In [6]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT sum(s.total)
FROM sales AS s
WHERE s.date BETWEEN '2015-02-01' AND '2015-02-28';
"""
pd.read_sql_query(sql, engine)

           sum
0  21295350.55

**Prompt 4 Answer**:

### Prompt 5

Among all transactions where `IMPORTED VODKA` was sold, which vendor has the most transactions? Report the total number of transactions, the number of bottles sold, and the total amount of revenue from these transactions. Rename the columns to make sure there isn't any confusion as to what they mean!

In [7]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT s.vendor,sum(s.bottle_qty) AS transactions, sum(s.total) AS revenue
FROM sales AS s
WHERE s.category_name = 'IMPORTED VODKA'
GROUP BY s.vendor
ORDER BY 2 DESC
LIMIT 5;
"""

pd.read_sql_query(sql, engine)

                             vendor  transactions     revenue
0  Pernod Ricard USA/Austin Nichols        403450  7880365.88
1               Bacardi U.S.A. Inc.        236047  5771242.07
2                   Diageo Americas        152038  3346425.42
3   Constellation Wine Company Inc.        116053  1895005.51
4                   Jim Beam Brands        104119  1807097.23

**Prompt 5 Answer**:

### Prompt 6

The reason we sell things is to make money. In sales, the term **markup** means the amount of extra money charged for a product over the cost to make that product. (You can think of the markup as the profit for that product.)

In Iowa, the law states the minimum price at which liquor may be sold.

Calculate the markup (name this `Markup`) that shows the difference between the `btl_price` and the `state_btl_cost`. 

> If you haven't subtracted columns together before, [this StackOverflow question](https://stackoverflow.com/questions/7536996/multiplying-two-columns-in-sql-server/7537059) may be helpful.

In [8]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT s.vendor,s.btl_price - s.state_btl_cost AS Markup
FROM sales AS s
ORDER BY Markup DESC;

"""

pd.read_sql_query(sql, engine)

                                   vendor     markup
0                Cedar Ridge VineyardsLLC  $2,900.00
1                Cedar Ridge VineyardsLLC  $2,900.00
2        Pernod Ricard USA/Austin Nichols    $799.60
3        Pernod Ricard USA/Austin Nichols    $799.60
4        Pernod Ricard USA/Austin Nichols    $799.60
...                                   ...        ...
3049908  Pernod Ricard USA/Austin Nichols      $0.49
3049909  Pernod Ricard USA/Austin Nichols      $0.49
3049910  Pernod Ricard USA/Austin Nichols      $0.49
3049911               Bacardi U.S.A. Inc.      $0.28
3049912         Monsieur Henri Wines Ltd.      $0.24

[3049913 rows x 2 columns]

### Prompt 7

Calculate the "Percentage Markup" by dividing markup by the state bottle cost. (Rather than the total profit per bottle, this will tell you how much stores are increasing their price over the state minimum.)

After calculating the "Percentage Markup," calculate the average percentage markup per **store**. Which store has the largest average markup, and what is that average markup?
### Store 4013 with Average Markup at .525471

In [9]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT s.store, AVG((s.btl_price - s.state_btl_cost)/ s.state_btl_cost)  AS Percentage_Markup
FROM sales AS s
GROUP BY store
ORDER BY percentage_markup DESC
LIMIT 5;
"""

pd.read_sql_query(sql, engine)

   store  percentage_markup
0   4013           0.525471
1   4024           0.521499
2   4266           0.518903
3   3833           0.515094
4   3660           0.514591

**Prompt 7 Answer**:

### Prompt 8

Building off of your last query, retrieve the five stores with the highest average markup percentage. Along with the store IDs and average markup percentage, please return the minimum and maximum markup percentage for those stores, as well as the names and addresses of those store.

What are the names of the five stores?

In [ ]:
SELECT c.color, m.mascot
FROM ncaa.mascots AS m
JOIN ncaa.team_colors c ON m.id = c.id;

In [12]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT n.store, n.store_address, AVG((s.btl_price - s.state_btl_cost)/ s.state_btl_cost)  AS Percentage_Markup
FROM sales AS s
JOIN stores AS n ON s.store = n.store
GROUP BY n.store
ORDER BY Percentage_Markup DESC
LIMIT 5;

"""

pd.read_sql_query(sql, engine)

   store                                      store_address  percentage_markup
0   4013  1126 Highway 38 North\nTipton, IA 527720000\n(...           0.525471
1   4024  840 S Oak\nIowa Falls, IA 501260000\n(42.50295...           0.521499
2   4266  705 S Fremont\nShenandoah, IA 516010000\n(40.7...           0.518903
3   3833  1905 East 7th St\nAtlantic, IA 500220000\n(41....           0.515094
4   3660  814 W Bell Ave\nKnoxville, IA 501380000\n(41.3...           0.514591

**Prompt 8 Answer**:

### Prompt 9

Which nine counties sell the highest number of bottles of liquor per capita (per person)? Calculate the average bottle size of the bottles of liquor sold by these counties rounded to the nearest first decimal place. Of the nine counties selling the highest number of bottles of liquor per capita, which county sells (on average) the largest bottle size?

**_BONUS FUN_**: This question can (also) be solved with a SQL subquery - that is, a query that queries a query! If you'd like to give this a try, you can read more about it [here](https://www.dofactory.com/sql/subquery). Otherwise, keep an eye out for the solution key!

In [ ]:
# Use a SQL query to find the answer to the above prompt.

sql = """

"""

pd.read_sql_query(sql, engine)

**Prompt 9 Answer**:

### Prompt 10 (advanced but required!)

In the `sales` table, three columns are `btl_price`, `bottle_qty`, and `total`. The `total` for a transaction _should be_ the product of `btl_price` and `bottle_qty`. How many transactions have a value of `total` that is not equal to `btl_price` time `bottle_qty`?

> There will be a type error as well! We cannot compare type `money` to type `real`. We have to convert `total` to type `money` so that we can compare the two directly. [This link](https://docs.microsoft.com/en-us/sql/t-sql/functions/cast-and-convert-transact-sql?view=sql-server-ver15#syntax) may be helpful to you!

In [13]:
# Use a SQL query to find the answer to the above prompt.cast = ::

sql = """
SELECT s.btl_price, s.bottle_qty, CAST(s.total AS money) , s.btl_price * s.bottle_qty AS total2
FROM sales AS s
WHERE CAST(s.total AS money)  != s.btl_price * s.bottle_qty
limit 10
"""

pd.read_sql_query(sql, engine)

Empty DataFrame
Columns: [btl_price, bottle_qty, total, total2]
Index: []

**Prompt 10 Answer**: